In [338]:
import pandas as pd

In [339]:
df = pd.read_csv('Titanic Dataset.csv')

In [340]:
df.shape

(1309, 14)

In [341]:
df.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [342]:
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [343]:
df.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881138,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413493,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.170000,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [344]:
df.drop(['name','cabin','boat','body','home.dest'],axis=1,inplace=True)

In [345]:
columns = df.columns

for column in columns:
    print(f"Column : {column}\n{df[column].value_counts()}")
    print(f"Nulls : {df[column].isnull().sum()}\n")

Column : pclass
3    709
1    323
2    277
Name: pclass, dtype: int64
Nulls : 0

Column : survived
0    809
1    500
Name: survived, dtype: int64
Nulls : 0

Column : sex
male      843
female    466
Name: sex, dtype: int64
Nulls : 0

Column : age
24.00    47
22.00    43
21.00    41
30.00    40
18.00    39
         ..
70.50     1
76.00     1
67.00     1
0.42      1
0.67      1
Name: age, Length: 98, dtype: int64
Nulls : 263

Column : sibsp
0    891
1    319
2     42
4     22
3     20
8      9
5      6
Name: sibsp, dtype: int64
Nulls : 0

Column : parch
0    1002
1     170
2     113
3       8
5       6
4       6
9       2
6       2
Name: parch, dtype: int64
Nulls : 0

Column : ticket
CA. 2343        11
1601             8
CA 2144          8
S.O.C. 14879     7
347082           7
                ..
315152           1
363592           1
4135             1
28034            1
364499           1
Name: ticket, Length: 929, dtype: int64
Nulls : 0

Column : fare
8.0500     60
13.0000    59
7.7500     55
26.0000    50
7.8958     49
           ..
13.7917     1
10.7083     1
7.7417      1
7.8208      1
34.6542     1
Name: fare, Length: 281, dtype: int64
Nulls : 1

Column : embarked
S    914
C    270
Q    123
Name: embarked, dtype: int64
Nulls : 2

In [346]:
df.drop(['ticket','fare'],axis=1,inplace=True)

In [347]:
df['age'].fillna(df['age'].median(),inplace=True)

In [348]:
df['is_man'] = (df['sex'] == 'male').astype(int)
df['is_woman'] = (df['sex'] == 'female').astype(int)
df['embarked_s'] = (df['embarked'] == 'S').astype(int)
df['embarked_c'] = (df['embarked'] == 'C').astype(int)
df['embarked_q'] = (df['embarked'] == 'Q').astype(int)
df.drop(['sex','embarked'],axis=1,inplace=True)

In [349]:
df = pd.get_dummies(df,columns=['pclass'])

In [350]:
df

,survived,age,sibsp,parch,is_man,is_woman,embarked_s,embarked_c,embarked_q,pclass_1,pclass_2,pclass_3
0,1,29.00,0,0,0,1,1,0,0,1,0,0
1,1,0.92,1,2,1,0,1,0,0,1,0,0
2,0,2.00,1,2,0,1,1,0,0,1,0,0
3,0,30.00,1,2,1,0,1,0,0,1,0,0
4,0,25.00,1,2,0,1,1,0,0,1,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,0,14.50,1,0,0,1,0,1,0,0,0,1
1305,0,28.00,1,0,0,1,0,1,0,0,0,1
1306,0,26.50,0,0,1,0,0,1,0,0,0,1
1307,0,27.00,0,0,1,0,0,1,0,0,0,1
1308,0,29.00,0,0,1,0,1,0,0,0,0,1

In [351]:
bins = [0,10,20,30,40,50,60,70,80]
labels = ['0-10','10-20','20-30','30-40','40-50','50-60','60-70','70-80']
df['age_group'] = pd.cut(df['age'], bins=bins, labels=labels, right=False)

In [352]:
df = pd.get_dummies(df,columns=['age_group'])

In [356]:
df.drop(['age'],axis=1,inplace=True)

In [357]:
df.columns

Index(['survived', 'sibsp', 'parch', 'is_man', 'is_woman', 'embarked_s',
       'embarked_c', 'embarked_q', 'pclass_1', 'pclass_2', 'pclass_3',
       'age_group_0-10', 'age_group_10-20', 'age_group_20-30',
       'age_group_30-40', 'age_group_40-50', 'age_group_50-60',
       'age_group_60-70', 'age_group_70-80'],
      dtype='object')

In [358]:
X,y = df[['sibsp', 'parch', 'is_man', 'is_woman', 'embarked_s',
       'embarked_c', 'embarked_q', 'pclass_1', 'pclass_2', 'pclass_3',
       'age_group_0-10', 'age_group_10-20', 'age_group_20-30',
       'age_group_30-40', 'age_group_40-50', 'age_group_50-60',
       'age_group_60-70', 'age_group_70-80']],df[['survived']]

In [359]:
from sklearn.model_selection import train_test_split 
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=.2,random_state=42)

In [360]:
from sklearn.ensemble import VotingClassifier 
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier

model1 = LogisticRegression(max_iter=500,class_weight='balanced')
model2 = DecisionTreeClassifier(class_weight='balanced')
model3 = RandomForestClassifier(n_estimators=200,max_depth=5,class_weight='balanced')

In [361]:
ensemble = VotingClassifier(estimators=[
    ('lr',model1),
    ('dt',model2),
    ('rf',model3)
],voting='hard')

In [362]:
ensemble.fit(X_train,y_train)

/Users/erdaulet/Desktop/allProjects/myenv/lib/python3.7/site-packages/sklearn/preprocessing/_label.py:98: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/Users/erdaulet/Desktop/allProjects/myenv/lib/python3.7/site-packages/sklearn/preprocessing/_label.py:133: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

VotingClassifier(estimators=[('lr',
                              LogisticRegression(class_weight='balanced',
                                                 max_iter=500)),
                             ('dt',
                              DecisionTreeClassifier(class_weight='balanced')),
                             ('rf',
                              RandomForestClassifier(class_weight='balanced',
                                                     max_depth=5,
                                                     n_estimators=200))])

In [363]:
y_pred = ensemble.predict(X_test)

In [364]:
from sklearn.metrics import classification_report
print(classification_report(y_test,y_pred))

              precision    recall  f1-score   support

           0       0.76      0.85      0.80       144
           1       0.78      0.68      0.73       118

    accuracy                           0.77       262
   macro avg       0.77      0.76      0.76       262
weighted avg       0.77      0.77      0.77       262